In [3]:
import pandas as pd
import numpy as np

### 누락값(nan) 처리

In [ ]:
# 누락값 확인

In [ ]:
print(np.NaN)
print(np.nan)
print(np.NAN)

In [ ]:
pd.Series([1,np.NaN,3])

In [ ]:
pd.isnull(None)

In [ ]:
pd.isnull(False)

In [ ]:
pd.isnull(np.NaN)

In [ ]:
pd.notnull(np.NaN)

In [ ]:
pd.notnull(None)

In [ ]:
pd.notnull(False)

In [ ]:
ebola=pd.read_csv('../data/country_timeseries.csv')
ebola.head()

In [ ]:
ebola.count()

In [ ]:
ebola.count()

In [ ]:
ebola.info()

In [ ]:
ebola.shape[0] - ebola.count()

In [ ]:
ebola.isnull().sum().sum()

In [ ]:
int(False)

In [ ]:
ebola['Cases_Guinea'].value_counts(dropna=True)

In [ ]:
ebola.sum()

In [ ]:
ebola.info()

In [ ]:
ebola.iloc[:,2:].mean()   # 일자로 나누어서 일일 발생자 확인

In [ ]:
ebola.isnull().sum() / ebola.shape[0] *100

In [ ]:
ebola.notnull().sum() / ebola.shape[0] *100

In [ ]:
ebola.notnull().sum(axis=1) / ebola.shape[1] *100

In [ ]:
!pip install missingno

In [ ]:
import missingno as msno

In [ ]:
msno.matrix(ebola)   # 누락값 그래프

In [ ]:
msno.bar(ebola)

In [ ]:
## 누락값 처리

In [ ]:
ebola.fillna(0)

In [ ]:
ebola.fillna(method='ffill')

In [ ]:
ebola.fillna(method='bfill')

In [ ]:
ebola.interpolate()

In [ ]:
ebola.dropna(axis=0)

In [ ]:
ebola.info()

In [ ]:
ebola.dropna(axis=1)

In [ ]:
ebola.dropna(subset=['Cases_Guinea'])

In [ ]:
print(pd.__version__)

In [ ]:
print(np.__version__)

In [ ]:
ebola_fill=ebola.fillna(method='bfill').fillna(0)

In [ ]:
ebola_fill.info()

1번 문제)  첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오. (소수점 첫째자리)

In [ ]:
basic=pd.read_csv('../data/basic1.csv')

In [ ]:
basic.info()

In [ ]:
a_group=basic.iloc[range(50)]
f1=a_group['f1']

In [ ]:
f1.median()

In [ ]:
f1.fillna(68)

In [ ]:
b_group=basic.iloc[50:]

In [ ]:
f1_1=b_group['f1']

In [ ]:
f1_1.max()

In [ ]:
f1_1.fillna(111)

In [ ]:
print(round(f1.std()+f1_1.std(),1))

2번 문제)  'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값을 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함. (단 소수점 둘째자리까지 출력(셋째자리에서 반올림))

In [ ]:
basic_sorted=basic.sort_values(['f4','f5'],ascending=[False,True])   #두 컬럼값을 다르게 sort하기

In [ ]:
# 앞에서 10개 데이터 중 f5컬럼 최소값 찾기
# 이 최소값보다 큰 10개 f5 컬럼 변경
# f5의 평균값(소숫점 2째자리)
basic_sorted_10=(basic_sorted.f5.iloc[:-10].min())
basic_sorted_10

In [ ]:
# 행바꾸기
a=round(basic['f5'].mean(),2)
a

1번 문제) 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼의 결측치를 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼의 결측치를 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오. (소수점 첫째자리)

In [ ]:
## 1번 분제 -쌤
# 순서대로 50% 1,2그룹으로 나눔
# A그룹은 누락값을 중앙값으로 f1컬럼대상  B그룹 누락값을 최대값으로f1컬럼대상
# A,B의 표준편차

In [2]:
df=pd.read_csv('../data/basic1.csv')

In [ ]:
# 순서대로 50% 1,2그룹으로 나눔
A=df.iloc[:50]
B=df.iloc[50:]
print(A.shape, B.shape)

In [ ]:
# A그룹은 누락값을 중앙값으로 f1컬럼대상
# B그룹 누락값을 최대값으로 f1컬럼대상
A_median=A['f1'].median()
B_max=B['f1'].max()

A_fill=A['f1'].fillna(A_median)
B_fill=B['f1'].fillna(B_max)
print(A_fill.count(), B_fill.count())

In [2]:
# A,B의 표준편차의 합
std_sum = A_fill.std() + B_fill.std()
round(std_sum, 1)

NameError: name 'A_fill' is not defined

In [ ]:
## 한줄로 식만들기 round(A['f'].A_fill.std()+B_fill.std(),1))

## 2번문제 --쌤
 'f4'컬럼 기준 내림차순 정렬과 'f5'컬럼 기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값을 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함. (단 소수점 둘째자리까지 출력(셋째자리에서 반올림))

In [ ]:
# 1. 'f4' 컬럼기준 내림차순 정렬 'f5'기준 올림차순
# 2. 앞에서부터 10개 데이터 중 'f5'컬럼 의 최소값
# 3. 앞에서부터 10개의 'f5'컬럼 데이터 변경
# 4. 'f5' 컬럼의 평균값(소수점 둘째)

In [ ]:
# 1
sorted_df=basic.sort_values(['f4','f5'],ascending=[False,True])   #두 컬럼값을 다르게 sort하기
#참고: 값 원본에 저장하기 ---copy(): 참조형 데이커를 복사하는 함수, 같은 값을갖는 변수가 됨
sorted_df2=sorted_df.copy()

In [ ]:
# 2 
sorted_df['f5'].iloc[10]
sorted_df.iloc[:10]['f5']

 ## 추천/ 이것만 다음 단계에서 작업 가능/ 특정위치에 값 넣으려면 iloc만 사용하는것 권유
sorted_df.iloc[:10, -1]

sorted_df.head(10)['f5']

In [ ]:
# 2-1 값 바꾸기 --참조형 데이터
min_value=sorted_df2.iloc[:10, -1].min()
sorted_df2.iloc[:10, -1]=min_value

In [ ]:
sorted_df2.head()

In [ ]:
# 3
round(sorted_df2['f5'].mean(),2)

In [ ]:
## 간단한 함수 만들기-apply 사욜하기

In [ ]:
def my_sq(x):
    return x ** 2

In [ ]:
def my_exp(x, n):
    return x ** n

In [ ]:
print(my_sq(4))
print(my_exp(3, 4))

In [ ]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df

In [ ]:
sq = df['a'].apply(my_sq)
print(sq)

In [ ]:
ex = df['a'].apply(my_exp, n=2)
print(ex)

In [ ]:
df['a']

In [ ]:
def pluse10(x):
    return x + 10
lambda x: x+10

In [ ]:
df['a'].apply(lambda x,n: x ** n , n=2)

In [ ]:
df=pd.read_csv('../data/basic1.csv')

In [ ]:
df

In [ ]:
def mbti(x):
    x[0]    # 인덱싱으로 가장 첫 문자만 자르기
    return x[0]
    
df['f4'].apply(mbti)

In [ ]:
df['mbti']=df['f4'].apply(mbti)   #새롭게 생성된 f4값을 전체값을 넣기 전체 보기

In [ ]:
def print_me(x):
    print(x)

In [ ]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]})
df.apply(print_me, axis=0)

In [ ]:
df.apply(print_me, axis=1)

In [ ]:
#lambda 함수 사용하기

In [ ]:
exam= pd.read_csv('../data/exam.csv')
exam.head(10)

In [ ]:
exam['math'].apply(lambda x : x // 10)

In [ ]:
exam.apply(lambda x : x.apply(lambda y: y // 10), axis = 1)

In [223]:
#ebola
ebola['Date2']=pd.to_datetime(ebola['Date'])
year=ebola['Date2'].dt.year

In [221]:
ebola['Data'].apply(lambda x: int )]  # 확인할 것

In [3]:
# 타이타닉 
titanic = pd.read_csv('../data/titanic.csv')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [231]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# 누락값의 비율 등을 얻을 수 있도록 함수 만들기
def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)  #return vec.isnll().sum()  세줄을 한줄로 
    return null_count
cmis_col = titanic.apply(count_missing)
cmis_col

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
titanic['Age'].isnull().sum()

177

In [11]:
def count_missing(vec):
    return vec.isnull().sum()

In [12]:
titanic.apply(count_missing, axis=0)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
titanic['Age'].size   #size는 괄호가 없음

891

In [15]:
def prop_missing(vec):
    # 누락 갯수 구하기
    num=count_missing(vec)
    # 전체 row(칼럼) 갯수
    length=vec.size
    return num/legth

In [ ]:
titanic['Sex'].apply()

In [18]:
# 남자 여자 성별 정수로 표현
def convert(x):
    if x=='male':
        return 0
    elif x=='female':
        return 1
    else:
        return np.nan

In [19]:
titanic['Sex']= titanic['Sex'].apply(convert)

In [20]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
# 결측값 정리하기
titanic['Age']   # 890 자료 있고 177 결측값 --> 평균나이 넣기

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [28]:
avg_age=titanic['Age'].mean()
avg_age

29.69911764705882

In [25]:
# 누락값 넣기
titanic['Age'].fillna(avg_age)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [30]:
# 문자열 칼럼에 결측값 넣기 
# 1단계 데이터 확인/ 알아보기
titanic['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [43]:
# 2단계 아무 의미없는 문자 N으로 채운다: 기타집단으로 만듦( 못쓰는 데이터는 N으로 퉁치고 나머지 데이터들 사용하려고)
titanic['Cabin'].fillna('N').apply(lambda x: x[0])

0      N
1      C
2      N
3      C
4      N
      ..
886    N
887    B
888    N
889    C
890    N
Name: Cabin, Length: 891, dtype: object

In [44]:
titanic['Cabin'].fillna('N').apply(lambda x: x[0]).unique()  # Embarked 의 누락 2개 --drop할 수도/

array(['N', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [40]:
titanic['Ticket'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Ticket, Length: 891, dtype: bool

In [42]:
 # E가 가장 많으므로 누락값을 E로 시작하게 할 수도// 확률이 놓은것으로 할것
titanic['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64